def square(n):
    '''Принимает число n, возвращает квадрат числа n
    
        Параметры:
            n (float): вещественное число

        Возвращаемое значение:
            square (float): квадрат числа n    
    '''
    return n**2

def add_binary(a, b):
    '''
    Возвращает сумму двух десятичных чисел в двоичном формате.

        Параметры:
            a (int): первое десятичное целое число
            b (int): второе десятичное целое число
        
        Возвращаемое значение:
            binary_sum (str): двоичная строка суммы a и b
    '''
    return f'{(a+b):b}'

def get_root(a, b):
    '''
    Возвращает корень из b числа a (ᵇ√a)

        Параметры:
            a (int): первое десятичное целое неотрицательное число, подкоренное число
            b (int): второе десятичное целое число, показатель корня
            
        Возвращаемое значение:
            get_root (float): результат извлечения корня
    '''
    return a**(1/b)

def is_prime(n):
    '''Принимает целое число n, возращает True если оно является простым, иначе - False
    
        Параметры:
            n (int): целое число
        
        Возвращаемое значение:
            is_prime (bool): True, если n - простое, иначе False
    '''
    if n <= 1: return False # Отрицательные числа, 0 и 1 не могут быть простыми
    for i in range(2, int(n**0.5)+1): # Ищем делители числа до его квадратного корня
        if n % i == 0: return False
    return True

