def area(a, b):
    '''Возвращает площадь прямоугольника со сторонами a, b
        
        Параметры:
            a (int): целое число, длина прямоугольника
            b (int): целое число, ширина прямоугольника
        
        Возвращаемое значение:
            area (int): площадь прямоугольника со сторонами a, b
    '''
    return a * b 

def perimeter(a, b): 
    '''Возвращает периметр прямоугольника со сторонами a, b

        Параметры:
            a (int): целое число, длина прямоугольника
            b (int): целое число, ширина прямоугольника
        
        Возвращаемое значение:
            perimeter (int): периметр прямоугольника со сторонами a, b
    '''
    return (a + b) * 2 
