def area(a, h):
    '''Возвращает площадь треугольника с основанием a и высотой h
        
        Параметры:
            a (int): целое число, основание треугольника
            h (int): целое число, высота треугольника
        
        Возвращаемое значение:
            area (float): площадь треугольника с основанием a и высотой h
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''Возвращает периметр треугольника со сторонами a, b, c
        
        Параметры:
            a, b, c (int): целое число, сторона треугольника
        
        Возвращаемое значение:
            perimeter (int): периметр треугольника со сторонами a, b, c
    '''
    return a + b + c 
